
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Адрес = ВыгрузитьСервер();
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов();
	ПолучитьФайлССервераАсинх(Адрес, "Выгрузка.csv", ПараметрыДиалога)

КонецПроцедуры

&НаКлиенте
Асинх Процедура Очистить(Команда)
	
	ТекстВопроса = "Все данные в подсистеме Бронирования будут удалены. Продолжить?";
	
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ВОзврат;
	КонецЕсли;
	
	ОчиститьСервер();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Загрузить(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов();
	ПараметрыДиалога.Фильтр = "Файл csv (*.csv)|*.csv";
	
	Результат = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСервер(Результат.Адрес);
	
	ПоказатьОповещениеПользователя("Загрузка выполнена");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьСервер()
	
	ВыгрузкаНомеров = ВыгрузитьНомера();
	Адрес = ПоместитьВоВременноеХранилище(ТаблицаВФайлCSV(ВыгрузкаНомеров));
	
	Возврат Адрес;
	
КонецФункции

&НаСервере
Процедура ОчиститьСервер()
	
	ОбработкаДанных.ОчиститьДанныеПодсистемыБронирований()
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСервер(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес); // ДвоичныеДанные
	
	ЗагрузитьНомерИзФайла(ДвоичныеДанные);
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНомерИзФайла(ДвоичныеДанные, Знач КоличествоКолонок = Неопределено)
	
	Результат = ИзвлечьДанныеИзФайлаCSV(ДвоичныеДанные, 4);
	
	Колонки = СтрРазделить("Идентификатор,Код,Наименование,Описание", ",");
	ДанныеНомеров = ПреобразоватьВМассивСтруктур(Результат, Колонки);
	ЗагрузитьПереченьНомеров(ДанныеНомеров);

КонецПроцедуры

&НаСервере
Функция ПреобразоватьВМассивСтруктур(ДвумерныйМассив, Колонки)
	
	Результат = Новый Массив;
	
	Для ИндексСтроки = 1 По ДвумерныйМассив.ВГраница() Цикл
		
		ДанныеСтроки = Новый Структура;
		
		Для ИндексКолонки = 0 По Колонки.ВГраница() Цикл
			
			ИмяКолонки = Колонки[ИндексКолонки];
			Значение = ДвумерныйМассив[ИндексСтроки][ИндексКолонки];
			ДанныеСтроки.Вставить(ИмяКолонки, Значение);
			
		КонецЦикла;
		
		Результат.Добавить(ДанныеСтроки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИзвлечьДанныеИзФайлаCSV(ДвоичныеДанные, КоличествоКолонок = Неопределено)
	
	Результат = Новый Массив;
	
	Чтение = Новый ЧтениеТекста(ДвоичныеДанные.ОткрытьПотокДляЧтения(), "windows-1251");
	
	НомерСтроки = 1;
	
	Пока Истина Цикл
		
		ДанныеСтроки = Новый Массив;
		
		РезультатЧтения = Чтение.ПрочитатьСтроку();
		
		Если РезультатЧтения = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		ДанныеСтроки = ИзвлечьДанныеСтроки(РезультатЧтения, НомерСтроки, Чтение, КоличествоКолонок);
		
		НомерСтроки = НомерСтроки + 1;
		
		Результат.Добавить(ДанныеСтроки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИзвлечьДанныеСтроки(ТекущаяСтрока, НомерТекущейСтроки, Чтение, КоличествоКолонок)
	
	Результат = Новый Массив;
	
	ТекущаяПозиция = 1;
			
	Пока Истина Цикл
		
		Если ТекущаяПозиция > СтрДлина(ТекущаяСтрока) Тогда
			Результат.Добавить("");
			Прервать;
		КонецЕсли;
		
		ПозицияРазделителя = СтрНайти(ТекущаяСтрока, СимволРазделительCSV(),, ТекущаяПозиция);
		ПозицияЭкранирования = СтрНайти(ТекущаяСтрока, """",, ТекущаяПозиция);
		
		Если ТекущаяПозиция = ПозицияРазделителя Тогда
			Результат.Добавить("");
			ТекущаяПозиция = ТекущаяПозиция + 1;
			Продолжить;
		КонецЕсли;
		
		Если ПозицияРазделителя = 0 И ПозицияЭкранирования = 0 Тогда
			ДанныеЯчейки = Сред(ТекущаяСтрока, ТекущаяПозиция);
			Результат.Добавить(ДанныеЯчейки);
			Прервать;
		КонецЕсли;
		
		// В ячейке символ экранирования в середине
		Если ТекущаяПозиция <> ПозицияЭкранирования
			И ПозицияЭкранирования < ПозицияРазделителя
			И ПозицияРазделителя <> 0 
			И ПозицияЭкранирования <> 0 Тогда
			ВызватьИсключение "Ошибка структуры файла в строке " + НомерТекущейСтроки;
		КонецЕсли;
		
		Если ТекущаяПозиция <> ПозицияЭкранирования Тогда
			ДанныеЯчейки = Сред(ТекущаяСтрока, ТекущаяПозиция, ПозицияРазделителя - ТекущаяПозиция);
			Результат.Добавить(ДанныеЯчейки);
			ТекущаяПозиция = ПозицияРазделителя + 1;
			Продолжить;
		КонецЕсли;
		
		// Экранирование
		ДанныеЯчейки = ИзвлечьЭкранированныйТекст(ТекущаяСтрока, ТекущаяПозиция, НомерТекущейСтроки, Чтение);
		Результат.Добавить(ДанныеЯчейки);
		
		Если ТекущаяПозиция = СтрДлина(ТекущаяСтрока) Тогда
			Прервать;
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоКолонок = Неопределено Тогда
		КоличествоКолонок = Результат.Количество();
	КонецЕсли;
	
	Если КоличествоКолонок <> Результат.Количество() Тогда
		ВызватьИсключение "Неожиданное число колонок в строке " + НомерТекущейСтроки;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИзвлечьЭкранированныйТекст(РезультатЧтения, ТекущаяПозиция, ТекущийНомерСтроки, Чтение)
	
	ТекущаяПозиция = ТекущаяПозиция + 1;
	
	Буфер = "";
	Пока Истина Цикл
		
		Курсор = СтрНайти(РезультатЧтения, """",, ТекущаяПозиция);
		
		Если Курсор = 0 Тогда
			Буфер = Буфер + Сред(РезультатЧтения, ТекущаяПозиция) + Символы.ПС;
			РезультатЧтения = Чтение.ПрочитатьСтроку();
			НомерСтроки = ТекущийНомерСтроки + 1;
			ТекущаяПозиция = 1;
			Если РезультатЧтения = Неопределено Тогда
				ВызватьИсключение "Неожиданный конец файла в строке " + НомерСтроки;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если Курсор = СтрДлина(РезультатЧтения) Тогда
			Буфер = Буфер + Сред(РезультатЧтения, ТекущаяПозиция, Курсор - ТекущаяПозиция);
			ТекущаяПозиция = Курсор;
			Прервать;
		КонецЕсли;
		
		Если Сред(РезультатЧтения, Курсор + 1, 1) = СимволРазделительCSV() Тогда
			Буфер = Буфер + Сред(РезультатЧтения, ТекущаяПозиция, Курсор - ТекущаяПозиция);
			ТекущаяПозиция = Курсор + 2;
			Прервать;
		КонецЕсли;
		
		Если Сред(РезультатЧтения, Курсор + 1, 1) = """" Тогда
			Буфер = Буфер + Сред(РезультатЧтения, ТекущаяПозиция, Курсор - ТекущаяПозиция + 1);
			ТекущаяПозиция = Курсор + 2;
			Продолжить;
		КонецЕсли;
		
		ВызватьИсключение "Ошибка структуры файла в строке " + НомерСтроки;				
		
	КонецЦикла;
		
	Возврат Буфер;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПереченьНомеров(ДанныеНомеров)
	
	Для Каждого ДанныеНомера Из ДанныеНомеров Цикл
		
		// Нормализация данных
		Идентификатор = ПолучитьИдентификаторИзСтроки(ДанныеНомера.Идентификатор);
		
		Ссылка = Справочники.Номера.ПолучитьСсылку(Идентификатор);
		
		СпрОбъект = Ссылка.ПолучитьОбъект();
		Если СпрОбъект = Неопределено Тогда
			СпрОбъект = Справочники.Номера.СоздатьЭлемент();
			СпрОбъект.УстановитьСсылкуНового(Ссылка);
		КонецЕсли;
		СпрОбъект.Код = ДанныеНомера.Код;
		СпрОбъект.Наименование = ДанныеНомера.Наименование;
		СпрОбъект.Описание = ДанныеНомера.Описание;
		СпрОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИдентификаторИзСтроки(ИдентификаторСтрока)
	
	// Стандартный шаблон uuid
	Шаблон = "[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}";
	
	Если СтрПодобнаПоРегулярномуВыражению(ИдентификаторСтрока, Шаблон, Истина) Тогда
		Возврат Новый УникальныйИдентификатор(ИдентификаторСтрока);
	КонецЕсли;
	
	ВызватьИсключение "Некорректный идентификатор";
	
КонецФункции

&НаСервере
Функция ВыгрузитьНомера()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Номера.Ссылка)) КАК Идентификатор,
		|	Номера.Код КАК Код,
		|	Номера.Наименование КАК Наименование,
		|	Номера.Описание КАК Описание
		|ИЗ
		|	Справочник.Номера КАК Номера";
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ТаблицаВФайлCSV(Таблица)
	
	Спецсимволы = СимволРазделительCSV() + Символы.ПС + """";
	
	Поток = Новый ПотокВПамяти();
	Запись = Новый ЗаписьТекста(Поток, "windows-1251");
	
	ДанныеСтроки = Новый Массив;
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Заголовок = Колонка.Заголовок;
		Если ПустаяСтрока(Заголовок) Тогда
			Заголовок = Колонка.Имя;
		КонецЕсли;
		ДанныеСтроки.Добавить(ПодготовитьЯчейкуCSV(Заголовок, Спецсимволы));
	КонецЦикла;
	
	Запись.ЗаписатьСтроку(СтрСоединить(ДанныеСтроки, СимволРазделительCSV()));
	
	КоличествоКолонок = Таблица.Колонки.Количество();
	Для Каждого Строка Из Таблица Цикл
		
		ДанныеСтроки = Новый Массив;
		
		Для ИндексКолонки = 0 По КоличествоКолонок - 1 Цикл
			ДанныеЯчейки = Строка[ИндексКолонки];
			ДанныеСтроки.Добавить(ПодготовитьЯчейкуCSV(ДанныеЯчейки, Спецсимволы));
		КонецЦикла;
		
		Запись.ЗаписатьСтроку(СтрСоединить(ДанныеСтроки, СимволРазделительCSV()));
		
	КонецЦикла;
	
	Запись.Закрыть();
	
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ДвоичныеДанные;
	
КонецФункции

&НаСервере
Функция ПодготовитьЯчейкуCSV(ВходныеДанные, Спецсимволы)
	
	Результат = XMLСтрока(ВходныеДанные);
	
	ЕстьСпецсимволы = Ложь;
	Для НомерСимвола = 1 По СтрДлина(Спецсимволы) Цикл
		Спецсимвол = Сред(Спецсимволы, НомерСимвола, 1);
		Если СтрНайти(Результат, Спецсимвол) > 0 Тогда
			ЕстьСпецсимволы = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьСпецсимволы Тогда
		Возврат Результат;
	КонецЕсли;
	
	Возврат """" + СтрЗаменить(Результат, """", """""") + """";
	
КонецФункции

&НаСервере
Функция СимволРазделительCSV()
	Возврат ";";
КонецФункции

#КонецОбласти

