
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриВставкеИзБуфераОбмена(Значение, СтандартнаяОбработка)
	
	Если ТипЗнч(Значение) = Тип("Картинка") Тогда
		ДобавитьКартинку(Значение);
	Иначе
		ДобавитьФайлыПоСсылкам(Значение, Элементы.Список.ТекущийРодитель);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		Отказ = Истина;
		НачатьДобавлениеФайла(Родитель);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	СкачатьФайл(ВыбраннаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	ДопустимыйТип = Истина;
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		Для Каждого ЭлементМассива Из ПараметрыПеретаскивания.Значение Цикл
			Если ТипЗнч(ЭлементМассива) <> Тип("СсылкаНаФайл") Тогда
				ДопустимыйТип = Ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("СсылкаНаФайл") Тогда
		ДопустимыйТип = Ложь;
	КонецЕсли;
	
	Если Не ДопустимыйТип Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Родитель = Элемент.ТекущийРодитель;
	
	Если Строка <> Неопределено Тогда
		ДанныеСтроки = Элемент.ДанныеСтроки(Строка);
		Если ДанныеСтроки.ЭтоГруппа Тогда
			Родитель = Строка;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СсылкаНаФайл") Тогда
		ДобавитьФайлПоСсылке(ПараметрыПеретаскивания.Значение, Родитель);
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		ДобавитьФайлыПоСсылкам(ПараметрыПеретаскивания.Значение, Родитель);
	Иначе
		ВызватьИсключение "Недопустимый тип значения перетаскивания";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкачатьВсе(Команда)

	АдресАрхива = ПодготовитьАрхив();
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	ПолучитьФайлССервераАсинх(АдресАрхива, "export.zip", ПараметрыДиалога);

КонецПроцедуры

&НаКлиенте
Асинх Процедура ВставитьИзБуфераОбмена(Команда)
	
	Если Не СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		ПредупреждениеАсинх("Работа с буфером обмена заблокирована");
	КонецЕсли;
	
	ФорматКартинка = СтандартныйФорматДанныхБуфераОбмена.Картинка;
	
	Если Не Ждать СредстваБуфераОбмена.СодержитДанныеАсинх(ФорматКартинка) Тогда
		Возврат;
	КонецЕсли;
	
	Картинка = Ждать СредстваБуфераОбмена.ПолучитьДанныеАсинх(ФорматКартинка);

	ДобавитьКартинку(Картинка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьКартинку(Картинка)
			
	Адрес = ПоместитьВоВременноеХранилище(Картинка);
	
	Ссылка = СохранитьКартинкуВСправочник(Адрес, Элементы.Список.ТекущийРодитель);
	
	ПослеСохраненияФайла(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура НачатьДобавлениеФайла(Родитель)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите файл для загрузки";
	
	ОповещениеПередНачалом = Новый ОписаниеОповещения("ПередНачаломЗагрузкиФайлов", ЭтотОбъект);
	
	Результат = Ждать ПоместитьФайлНаСерверАсинх(, ОповещениеПередНачалом,, ПараметрыДиалога);
	
	ЗаписатьФайлыПослеЗагрузкиНаСервер(Результат, Родитель);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДобавитьФайлПоСсылке(СсылкаНаФайл, Родитель)
	
	ОповещениеПередНачалом = Новый ОписаниеОповещения("ПередНачаломЗагрузкиФайлов", ЭтотОбъект);
	
	Если Ждать СсылкаНаФайл.Файл.ЭтоКаталогАсинх() Тогда
		ПредупреждениеАсинх("Загрузка каталогов не поддерживается");
		Возврат;
	КонецЕсли;
	
	Результат = Ждать ПоместитьФайлНаСерверАсинх(, ОповещениеПередНачалом,, СсылкаНаФайл);
	
	ЗаписатьФайлыПослеЗагрузкиНаСервер(Результат, Родитель);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДобавитьФайлыПоСсылкам(СсылкиНаФайлы, Родитель)
	
	ОповещениеПередНачалом = Новый ОписаниеОповещения("ПередНачаломЗагрузкиФайлов", ЭтотОбъект);
	
	Результат = Ждать ПоместитьФайлыНаСерверАсинх(, ОповещениеПередНачалом, СсылкиНаФайлы);
	
	ЗаписатьФайлыПослеЗагрузкиНаСервер(Результат, Родитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьФайлыПослеЗагрузкиНаСервер(РезультатЗагруки, Родитель = Неопределено)
	
	Если РезультатЗагруки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(РезультатЗагруки) = Тип("ОписаниеПомещенногоФайла") Тогда
		ФайлыДляОбработки = Новый Массив;
		ФайлыДляОбработки.Добавить(РезультатЗагруки);
	Иначе
		ФайлыДляОбработки = РезультатЗагруки;
	КонецЕсли;
	
	ОписаниеФайлов = Новый Массив;
	Для Каждого ФайлДляОбработки Из ФайлыДляОбработки Цикл
		
		Если ФайлДляОбработки.ПомещениеФайлаОтменено Тогда
			Продолжить;
		КонецЕсли;
		
		СсылкаНаФайл = ФайлДляОбработки.СсылкаНаФайл;
		
		Размер = СсылкаНаФайл.Размер();
		Имя = СсылкаНаФайл.Имя;
		Расширение = СсылкаНаФайл.Расширение;
		
		ОписаниеФайла = ОписаниеФайла(ФайлДляОбработки.Адрес, Имя, Расширение, Размер);
		
		ОписаниеФайлов.Добавить(ОписаниеФайла);
		
	КонецЦикла;
	
	Ссылка = СохранитьВСправочник(ОписаниеФайлов, Родитель);
	
	ПослеСохраненияФайла(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФайла(Ссылка)
		
	ОповеститьОбИзменении(Ссылка);
	
	ПоказатьОповещениеПользователя("Файл сохранен", 
		ПолучитьНавигационнуюСсылку(Ссылка),
		Ссылка);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеФайла(Адрес, Имя, Расширение, Размер)
	
	Результат = Новый Структура;
	Результат.Вставить("Адрес", Адрес);
	Результат.Вставить("Имя", Имя);
	Результат.Вставить("Расширение", Расширение);
	Результат.Вставить("Размер", Размер);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередНачаломЗагрузкиФайлов(ПомещаемыеФайлы, ОтказОтПомещенияФайла, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ПомещаемыеФайлы) = Тип("СсылкаНаФайл") Тогда
		СсылкиДляПроверки = Новый Массив;
		СсылкиДляПроверки.Добавить(ПомещаемыеФайлы);
	Иначе
		СсылкиДляПроверки = ПомещаемыеФайлы;
	КонецЕсли;
	
	ПревышенДопустимыйРазмер = Ложь;
	Для Каждого СсылкаДляПроверки Из СсылкиДляПроверки Цикл
		Если СсылкаДляПроверки.Размер() > 10000000 Тогда
			ПревышенДопустимыйРазмер = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ПревышенДопустимыйРазмер Тогда
		ОтказОтПомещенияФайла = Истина;
		ПредупреждениеАсинх("Размер файла должен быть меньше 10 МБ");
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте
Асинх Процедура СкачатьФайл(Ссылка)
		
	ДанныеФайла = ДанныеФайла(Ссылка);
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	ПолучитьФайлССервераАсинх(ДанныеФайла.Адрес, ДанныеФайла.Имя, ПараметрыДиалога);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеФайла(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Наименование КАК Наименование,
		|	Файлы.Расширение КАК Расширение,
		|	Файлы.ДвоичныеДанные КАК ДвоичныеДанные
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	ДвоичныеДанные = Выборка.ДвоичныеДанные.Получить();
	
	Результат = Новый Структура;
	Результат.Вставить("Имя", Выборка.Наименование);
	Результат.Вставить("Расширение", Выборка.Расширение);
	Результат.Вставить("Адрес", ПоместитьВоВременноеХранилище(ДвоичныеДанные));
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СохранитьВСправочник(ОписаниеФайлов, Родитель)
	
	Результат = Неопределено;
	
	Для Каждого ОписаниеФайла Из ОписаниеФайлов Цикл
		
		ДанныеФайла = ПолучитьИзВременногоХранилища(ОписаниеФайла.Адрес);
		
		Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
		Хеширование.Добавить(ДанныеФайла);
		
		ХешСумма = Base64Строка(Хеширование.ХешСумма);
		
		СпрОбъект = Справочники.Файлы.СоздатьЭлемент();
		СпрОбъект.Наименование = ОписаниеФайла.Имя;
		СпрОбъект.Расширение = ОписаниеФайла.Расширение;
		СпрОбъект.РазмерФайла = ОписаниеФайла.Размер;
		СпрОбъект.ХешСумма = ХешСумма;
		СпрОбъект.Родитель = Родитель;
		СпрОбъект.ДвоичныеДанные = Новый ХранилищеЗначения(ДанныеФайла);
		
		СпрОбъект.Записать();
		
		Если Результат = Неопределено Тогда
			Результат = СпрОбъект.Ссылка;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СохранитьКартинкуВСправочник(Адрес, Родитель)
	
	Картинка = ПолучитьИзВременногоХранилища(Адрес);
	
	Расширение = РасширениеКартинки(Картинка);
	Имя = Формат(ТекущаяДатаСеанса(), "ДФ='""img-""гггг-ММ-дд-ЧЧ-мм-сс';") + Расширение;
	Размер = Картинка.РазмерФайла();
	АдресДвоичныхДанных = ПоместитьВоВременноеХранилище(Картинка.ПолучитьДвоичныеДанные());
	
	ОписаниеФайла = ОписаниеФайла(АдресДвоичныхДанных, Имя, Расширение, Размер);
	
	ОписаниеФайлов = Новый Массив;
	ОписаниеФайлов.Добавить(ОписаниеФайла);
	
	Возврат СохранитьВСправочник(ОписаниеФайлов, Родитель);
	
КонецФункции

&НаСервере
Функция ПодготовитьАрхив()
	
	Поток = Новый ПотокВПамяти;
	
	ЗаписьАрхива = Новый ЗаписьФайлаАрхива(Поток);
	
	ИмяВременногоКаталога = ПолучитьИмяВременногоФайла("");
	СоздатьКаталог(ИмяВременногоКаталога);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка,
		|	Файлы.ЭтоГруппа КАК ЭтоГруппа,
		|	Файлы.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	НЕ Файлы.ЭтоГруппа
		|ИТОГИ
		|ПО
		|	Ссылка ТОЛЬКО ИЕРАРХИЯ";
		
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	СохранитьФайлыВыборки(Выборка, ИмяВременногоКаталога);
		
	ЗаписьАрхива.Добавить(ИмяВременногоКаталога + "/*.*", 
		РежимСохраненияПутейФайлаАрхива.СохранятьОтносительныеПути,
		РежимОбработкиПодкаталоговФайлаАрхива.ОбрабатыватьРекурсивно);
		
	ЗаписьАрхива.Записать();
	
	//@skip-check empty-except-statement - не обрабатываем ошибку удаления файла
	Попытка
		УдалитьФайлы(ИмяВременногоКаталога);
	Исключение
		// Ошибка при удалении файла
	КонецПопытки;
	
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

&НаСервереБезКонтекста
Функция РасширениеКартинки(Картинка)
	
	Если Картинка.Формат() = ФорматКартинки.BMP Тогда
		Расширение = ".bmp";
	ИначеЕсли Картинка.Формат() = ФорматКартинки.GIF Тогда
		Расширение = ".gif";
	ИначеЕсли Картинка.Формат() = ФорматКартинки.JPEG Тогда
		Расширение = ".jpeg";
	ИначеЕсли Картинка.Формат() = ФорматКартинки.PNG Тогда
		Расширение = ".png";
	ИначеЕсли Картинка.Формат() = ФорматКартинки.Icon Тогда
		Расширение = ".ico";
	ИначеЕсли Картинка.Формат() = ФорматКартинки.EMF Тогда
		Расширение = ".emf";
	ИначеЕсли Картинка.Формат() = ФорматКартинки.WMF Тогда
		Расширение = ".wmf";
	ИначеЕсли Картинка.Формат() = ФорматКартинки.TIFF Тогда
		Расширение = ".tiff";
	Иначе
		Расширение = ".png";
	КонецЕсли;
	
	Возврат Расширение;
	
КонецФункции

&НаСервере
//@skip-check query-in-loop - двоичные данные получаем по необходимости
Процедура СохранитьФайлыВыборки(Выборка, ИмяВременногоКаталога)
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			ВложеннаяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			СохранитьФайлыВыборки(ВложеннаяВыборка, ИмяВременногоКаталога);
			Продолжить;
		КонецЕсли;			
		
		Если Выборка.ЭтоГруппа Тогда
			ИмяВложенногоКаталога = ИмяВременногоКаталога + ПолучитьРазделительПути() + Выборка.Наименование;
			Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда
				ВложеннаяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Ссылка");
			Иначе
				ВложеннаяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			КонецЕсли;	
			СоздатьКаталог(ИмяВложенногоКаталога);
			СохранитьФайлыВыборки(ВложеннаяВыборка, ИмяВложенногоКаталога);
		Иначе
			ДвоичныеДанные = ДвоичныеДанныеПоСсылке(Выборка.Ссылка);
			ИмяФайла = ИмяВременногоКаталога + ПолучитьРазделительПути() + Выборка.Наименование;
			ДвоичныеДанные.Записать(ИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДвоичныеДанныеПоСсылке(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.ДвоичныеДанные КАК ДвоичныеДанные
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.ДвоичныеДанные.Получить();
	
КонецФункции

#КонецОбласти


