
Процедура ОчиститьДанныеПодсистемыБронирований() Экспорт
	
	НаборЗаписей = РегистрыСведений.ДатыБронирований.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.ЗначенияХарактеристикГостиничныхНомеров.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();

	Выборка = Справочники.Номера.Выбрать();	
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.ПолучитьОбъект();
		СпрОбъект.Удалить();
	КонецЦикла;
	
	Выборка = ПланыВидовХарактеристик.ХарактеристикиГостиничныхНомеров.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПВХОбъект = Выборка.ПолучитьОбъект();
		ПВХОбъект.Удалить();
	КонецЦикла;	
		
КонецПроцедуры