
&НаКлиенте
Процедура Сохранить(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Номер", Номер);
	Результат.Вставить("ДатаНачала", ДатаНачала);
	Результат.Вставить("ДатаОкончания", ДатаОкончания);
	
	Закрыть(Результат);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого ЭлементКеша Из Параметры.КешНомеров Цикл
		
		ОписаниеНомера = ЭлементКеша.Значение;
		Элементы.Номер.СписокВыбора.Добавить(ОписаниеНомера.Идентификатор, ОписаниеНомера.Наименование);
		
	КонецЦикла;

КонецПроцедуры
