
#Область ОбработчикиСобытий

Функция PingПроверитьДоступность(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Ok");
	Возврат Ответ;
КонецФункции


Функция ПолучитьДанные(Запрос)
	
	ИдентификаторКлиента = Запрос.Заголовки.Получить("X-MobileID");
	НомерПринятогоСообщения = Число(Запрос.Заголовки.Получить("X-Received-Message"));
	
	ТелоОтвета = ОбменМобильноеПриложение.СформироватьДанныеОтвета(ИдентификаторКлиента, НомерПринятогоСообщения);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

