
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Константы.АдресЦентральнойБазы.Получить();
	Логин = Константы.ЛогинЦентральнойБазы.Получить();
	Пароль = Константы.ПарольЦентральнойБазы.Получить();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	СохранитьНастройки();
КонецПроцедуры

#КонецОбласти
&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ВыполнитьОбменНаСервере();
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройки()
	
	Константы.АдресЦентральнойБазы.Установить(Адрес);
	Константы.ЛогинЦентральнойБазы.Установить(Логин);
	Константы.ПарольЦентральнойБазы.Установить(Пароль);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбменНаСервере()
	
	НастройкиПодключения = НастройкиПодключения();
	
	Соединение = Новый HTTPСоединение(НастройкиПодключения.АдресСервера,,
		НастройкиПодключения.Логин,
		НастройкиПодключения.Пароль,,,
		НастройкиПодключения.ЗащищенноеСоединение);
		
	СистемнаяИнформации = Новый СистемнаяИнформация;
	ИдентификаторКлиента = Строка(СистемнаяИнформации.ИдентификаторКлиента);	
		
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-MobileID", ИдентификаторКлиента);
	Заголовки.Вставить("X-Received-Message", 0);
	
	АдресРесурса = НастройкиПодключения.ПутьНаСервере + "/hs/mobile/exchange";
	Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access - устарел только на клиенте
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка обмена";
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	ДанныеОтвета = ПрочитатьЗначениеJSON(ТелоОтвета);
	
	Для Каждого ОписаниеОбъекта Из ДанныеОтвета Цикл
		
		Если ОписаниеОбъекта.Тип = "Справочник.ДоговорыКонтрагентов" Тогда
			ЗаписатьДоговор(ОписаниеОбъекта);
		ИначеЕсли ОписаниеОбъекта.Тип = "Справочник.Контрагенты" Тогда
			ЗаписатьКонтрагента(ОписаниеОбъекта);
		ИначеЕсли ОписаниеОбъекта.Тип = "Справочник.Номенклатура" Тогда 
			ЗаписатьНоменклатуру(ОписаниеОбъекта);
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНоменклатуру(ОписаниеОбъекта)
	
	Ссылка = Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОписаниеОбъекта.Идентификатор));
		
	СпрОбъект = Ссылка.ПолучитьОбъект();
	Если СпрОбъект = Неопределено Тогда
		Если ОписаниеОбъекта.ЭтоГруппа Тогда
			СпрОбъект = Справочники.Номенклатура.СоздатьГруппу();
		Иначе
			СпрОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		КонецЕсли;
		СпрОбъект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	СпрОбъект.Наименование = ОписаниеОбъекта.Наименование;
	СпрОбъект.Родитель = Справочники.Номенклатура.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОписаниеОбъекта.Родитель));
		
	СпрОбъект.ОбменДанными.Загрузка = Истина;
	
	СпрОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонтрагента(ОписаниеОбъекта)
	
	Ссылка = Справочники.Контрагенты.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОписаниеОбъекта.Идентификатор));
		
	СпрОбъект = Ссылка.ПолучитьОбъект();
	Если СпрОбъект = Неопределено Тогда
		СпрОбъект = Справочники.Контрагенты.СоздатьЭлемент();
		СпрОбъект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	СпрОбъект.Наименование = ОписаниеОбъекта.Наименование;
		
	СпрОбъект.ОбменДанными.Загрузка = Истина;
	
	СпрОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура ЗаписатьДоговор(ОписаниеОбъекта)
	
	Ссылка = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОписаниеОбъекта.Идентификатор));
		
	СпрОбъект = Ссылка.ПолучитьОбъект();
	Если СпрОбъект = Неопределено Тогда
		СпрОбъект = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		СпрОбъект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	СпрОбъект.Наименование = ОписаниеОбъекта.Наименование;
	СпрОбъект.Владелец = Справочники.Контрагенты.ПолучитьСсылку(
		Новый УникальныйИдентификатор(ОписаниеОбъекта.Владелец));
		
	СпрОбъект.ОбменДанными.Загрузка = Истина;
	
	СпрОбъект.Записать();

КонецПроцедуры

&НаСервере
Функция НастройкиПодключения()
	
	Результат = Новый Структура;
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	
	Если СтрНачинаетсяС(Адрес, "https") Тогда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	Иначе
		ЗащищенноеСоединение = Неопределено;
	КонецЕсли;		
		
	Результат.Вставить("ЗащищенноеСоединение", ЗащищенноеСоединение);
	
	Курсор = СтрНайти(Адрес, "://");
	АдресБезПротокола = Сред(Адрес, Курсор + 3);
	
	Курсор = СтрНайти(АдресБезПротокола, "/");
	АдресСервера = Лев(АдресБезПротокола, Курсор - 1);
	ПутьНаСервере = Сред(АдресБезПротокола, Курсор);
	
	Результат.Вставить("АдресСервера", АдресСервера);
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;

КонецФункции

#КонецОбласти
