
#Область ПрограммныйИнтерфейс
 
// Цена номенклатуры.
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура
//  Организация - СправочникСсылка.Организации
//  Период - Дата, Неопределено - Период
// 
// Возвращаемое значение:
//  Число - Цена номенклатуры
//
Функция ЦенаНоменклатуры(Номенклатура, Организация, Период = Неопределено) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	Отбор.Вставить("Организация", Организация);
	
	РеквизитыЗаписи = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(Период, Отбор);
	
	Возврат РеквизитыЗаписи.Цена;
	
КонецФункции

#КонецОбласти