
&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБронирование(Команда)
	
	Если КешНомеров = Неопределено Тогда
		ОбновитьКешНомеров();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КешНомеров", КешНомеров);
	
	Оповещение = Новый ОписаниеОповещения("ДобавитьБронированиеЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ПолучениеДанныхHTTP.Форма.ВводНовогоБронирования", 
		ПараметрыФормы,,,,,
		Оповещение)

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБронированиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьБронированиеСервер(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьБронированиеСервер(Результат)
	
	Прокси = ПолучитьПрокси();
	
	ТипОписаниеБронирования = Прокси.ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "book");
	ОписаниеБронированияXDTO = Прокси.ФабрикаXDTO.Создать(ТипОписаниеБронирования);
	
	ОписаниеБронированияXDTO.roomId = Результат.Номер;
	ОписаниеБронированияXDTO.startDate = Результат.ДатаНачала;
	ОписаниеБронированияXDTO.endDate = Результат.ДатаОкончания;
	
	Прокси.CreateBooking(ОписаниеБронированияXDTO);
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	Прокси = ПолучитьПрокси();
	
	ТипФильтр = Прокси.ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "booksFilter");
	Фильтр = Прокси.ФабрикаXDTO.Создать(ТипФильтр);
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		Фильтр.startDate = ДатаНачала;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		Фильтр.endDate = ДатаОкончания;
	КонецЕсли;
	
	ДанныеБронирований = Прокси.GetBookings(Фильтр);
	
	Бронирования.Очистить();
	
	Для Каждого ДанныеБронирования Из ДанныеБронирований.book Цикл
		
		Строка = Бронирования.Добавить();
		Строка.ИдентификаторНомера = ДанныеБронирования.roomId;
		Строка.ДатаНачала = ДанныеБронирования.startDate;
		Строка.ДатаОкончания = ДанныеБронирования.endDate;
		
		ЗаполнитьСвойстваНомера(Строка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваНомера(Строка)
	
	КешОбновлен = Ложь;
	
	Если КешНомеров = Неопределено Тогда
		ОбновитьКешНомеров();
		КешОбновлен = Истина;
	КонецЕсли;
	
	ДанныеНомера = ПолучитьДанныеНомераИзКеша(Строка.ИдентификаторНомера);
	
	Если ДанныеНомера = Неопределено И Не КешОбновлен Тогда
		ОбновитьКешНомеров();
		ДанныеНомера = ПолучитьДанныеНомераИзКеша(Строка.ИдентификаторНомера);
	КонецЕсли;	

	Если ДанныеНомера = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка.Номер = ДанныеНомера.Наименование;
	Строка.ОписаниеНомера = ДанныеНомера.Описание;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеНомераИзКеша(ИдентификаторНомера)
	
	БезопасныйИдентификатор = БезопасныйИдентификатор(ИдентификаторНомера);
	
	Если КешНомеров.Свойство(БезопасныйИдентификатор) Тогда
		Возврат КешНомеров[БезопасныйИдентификатор];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ОбновитьКешНомеров()
	
	Прокси = ПолучитьПрокси();
	
	КешНомеров = Новый Структура;
	
	ДанныеНомеров = Прокси.GetRooms();
	
	Для Каждого ДанныеНомера Из ДанныеНомеров.room Цикл
		
		НомерОбъект = Новый Структура;
		НомерОбъект.Вставить("Идентификатор", ДанныеНомера.id);
		НомерОбъект.Вставить("Наименование", ДанныеНомера.name);
		НомерОбъект.Вставить("Код", ДанныеНомера.code);
		НомерОбъект.Вставить("Описание", ДанныеНомера.description);
		
		КешНомеров.Вставить(БезопасныйИдентификатор(ДанныеНомера.id), НомерОбъект);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция БезопасныйИдентификатор(Идентификатор)
	
	Возврат "id_" + СтрЗаменить(Идентификатор, "-", "_");
	
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПроверитьПодключениеНаСервере()
	
	Прокси = ПолучитьПрокси();
	
	Ответ = Прокси.Ping();
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("Успех", Истина);
	РезультатПроверки.Вставить("ТекстОшибки", "");
	
	Возврат РезультатПроверки;

КонецФункции

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	РезультатПроверки = ПроверитьПодключениеНаСервере();
	
	Если РезультатПроверки.Успех Тогда
		ПредупреждениеАсинх("Успех");
	Иначе
		ПредупреждениеАсинх(РезультатПроверки.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПрокси()
	
	Определение = Новый WSОпределения(АдресПриложения, Логин, Пароль);
	
	Прокси = Новый WSПрокси(Определение, 
		"http://narfu.ru/151315/booking", 
		"booking", 
		"bookingSoap12");
	Прокси.Пользователь = Логин;
	Прокси.Пароль = Пароль;
	
	Возврат Прокси
	
КонецФункции
