
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	
	СтрокаТабЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСуммуСтроки(СтрокаТабЧасти);
		
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	СтрокаТабЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСуммуСтроки(СтрокаТабЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Цена = ЦеныНоменклатурыВызовСервера.ЦенаНоменклатуры(
		ТекущиеДанные.Номенклатура, Объект.Дата);
			
	ТекущиеДанные.Цена = Цена;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(Строка)
	Строка.Сумма = Строка.Количество * Строка.Цена;
КонецПроцедуры

#КонецОбласти



