
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	
	СтрокаТабЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	СтрокаТабЧасти.Сумма = СтрокаТабЧасти.Цена * СтрокаТабЧасти.Количество;
	
		
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	СтрокаТабЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	СтрокаТабЧасти.Сумма = СтрокаТабЧасти.Количество * СтрокаТабЧасти.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ПозицияНоменклатуры = СтрокаТабЧасти.Номенклатура;
	ЦенаНоменклатуры = СписокНоменклатурыНоменклатураПриИзмененииНаСервере(ПозицияНоменклатуры);
	СтрокаТабЧасти.Цена = ЦенаНоменклатуры;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокНоменклатурыНоменклатураПриИзмененииНаСервере(ПозицияНоменклатуры)
	
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(ПозицияНоменклатуры);
	Возврат Номенклатура.Цена;
	
КонецФункции

#КонецОбласти



