#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьАрхивНоменклатуры(Команда)
	
	АдресФайла = СформироватьАрхивНаСервере();
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	ПолучитьФайлССервераАсинх(АдресФайла, "export.zip", ПараметрыДиалога);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьАрхивНаСервере()
		
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	АдресАрхива = РеквизитОбъект.ПодготовитьАрхив();
	Возврат АдресАрхива;
	
КонецФункции

#КонецОбласти

