#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Константы.АдресЦентральнойБазы.Получить();
	Логин = Константы.ЛогинЦентральнойБазы.Получить();
	Пароль = Константы.ПарольЦентральнойБазы.Получить();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ЗаписатьФотоДоговора(ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПоказатьФотоДоговора(ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СделатьФото(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
     
    Если НЕ СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
      	Сообщение = Новый СообщениеПользователю();
      	Сообщение.Текст = "Данное устройство не поддерживает работу с камерой";
      	Сообщение.Сообщить();
        Возврат;
    КонецЕсли;
    
    ДанныеМультимедиа = СредстваМультимедиа.СделатьФотоснимок();
    Если ДанныеМультимедиа = Неопределено Тогда
        Сообщение = Новый СообщениеПользователю();
      	Сообщение.Текст = "Не удалось сделать фото";
      	Сообщение.Сообщить();
        Возврат;     
    КонецЕсли;
 
    ДвоичныеДанныеФото = ДанныеМультимедиа.ПолучитьДвоичныеДанные();
    Картинка = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФото, УникальныйИдентификатор);

    #КонецЕсли
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьФотоДоговора(ТекущийОбъект)
	
	Если ЭтоАдресВременногоХранилища(Картинка) Тогда
		ТекущийОбъект.ФотоДоговора = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Картинка));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьФотоДоговора(ТекущийОбъект)
	
	Картинка = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "ФотоДоговора");
	
КонецПроцедуры

#КонецОбласти



